blueskycoco/rtt/bsp/stm32f10x/drivers/sdio-stm32f103.c
#include "stm32_eval_sdio_sd.h"
#include "stm32f10x_dma.h"
#include "stm32f10x_sdio.h"
#include "stdbool.h"
#include <rtthread.h>
#define SDIO_CMD0TIMEOUT                ((uint32_t)0x00002710)
#define SDIO_INIT_CLK_DIV                  ((uint8_t)0xB2)
#define SDIO_FIFO_ADDRESS                ((uint32_t)0x40018080)
#define SD_DATATIMEOUT                  ((uint32_t)0xFFFFFFFF)
SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;
#define SDIO_STATIC_FLAGS               ((uint32_t)0x000005FF)
#define SD_STD_CAPACITY                 ((uint32_t)0x00000000)
mmc_card_t card;
rt_uint32_t CmdResp4Error(uint8_t cmd);
void acquire_io()
{
	 rt_sem_take(&(card->sem_lock), RT_WAITING_FOREVER);
}
void release_io()
{
	 rt_sem_release(&(card->sem_lock));
}

static SD_Error CmdError(void)
{
	 SD_Error errorstatus = SD_OK;
	 uint32_t timeout;

	 timeout = SDIO_CMD0TIMEOUT; /* 10000 */

	 while ((timeout > 0) && (SDIO_GetFlagStatus(SDIO_FLAG_CMDSENT) == RESET))
	 {
		  timeout--;
	 }

	 if (timeout == 0)
	 {
		  errorstatus = SD_CMD_RSP_TIMEOUT;
		  return(errorstatus);
	 }

	 /* Clear all the static flags */
	 SDIO_ClearFlag(SDIO_STATIC_FLAGS);

	 return(errorstatus);
}

static int rw_ioreg(ioreg_t * ioreg)
{
	 int ret;
	 rt_uint16_t argh = 0, argl = 0,response;

	 /* Nicely fill up argh and argl send the command down
	  * Read the response from MMC_R1
	  */

	 acquire_io();

	 /* SDIO Spec: CMD52 is 48 bit long. 
		-----------------------------------------------------------
		S|D|CMDIND|R|FUN|F|S|REGISTER  ADDRESS|S|WRITEBIT|CRC    7|
		-----------------------------------------------------------
		The Command and the Command index will be filled by the SDIO Controller
		(48 - 16)
		So fill up argh (16 bits) argl (16 bits) with 
		R/W flag (1)
		FUNC NUMBER (3)
		RAW FLAG (1)
		STUFF (1)
		REG ADDR (17)
		and the Write data value or a Null if read
		*/
	 argh =
		  (ioreg->read_or_write ? (1 << 15) : 0) |
		  (ioreg->function_num << 12) |
		  (ioreg->read_or_write == 2 ? (1 << 11) : 0) |
		  ((ioreg->reg_addr & 0x0001ff80) >> 7);

	 argl =
		  ((ioreg->reg_addr & 0x0000007f) << 9) |
		  (ioreg->read_or_write ? ioreg->dat : 0);

	 //MMC_CMD = CMD(52);
	 //MMC_ARGH = argh;
	 //MMC_ARGL = argl;
	 //wmb();
	 SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SDIO_RW_DIRECT;
	 SDIO_CmdInitStructure.SDIO_Argument = (argh<<16)|argl;

#define CARD_RESET 8
#define HOST_INTSTATUS_REG 0x05
	 /* Disabling controller to check for SDIO interrupt from the card
		solves the extra interrupt issue. The next CMD52 write will re-enable it. */
	 if ((ioreg->reg_addr == HOST_INTSTATUS_REG) &&
			   !ioreg->read_or_write && (ioreg->function_num == FN1))
	 {
		  //MMC_CMDAT = MMC_CMDAT_R1 & (~MMC_CMDAT_SDIO_INT_EN);
		  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		  SDIO_CmdInitStructure.SDIO_Response=SDIO_Response_Short;
	 }
	 else if ((ioreg->reg_addr == IO_ABORT_REG) && ioreg->read_or_write &&
			   (ioreg->function_num == FN0) &&
			   ((ioreg->dat & CARD_RESET) == CARD_RESET))
	 {
		  //MMC_CMDAT = MMC_CMDAT_SDIO_INT_EN;
		  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_IT;
		  SDIO_CmdInitStructure.SDIO_Response=SDIO_Response_No;
	 }
	 else
	 {
		  //MMC_CMDAT = MMC_CMDAT_R1;       /* R5 */
		  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		  SDIO_CmdInitStructure.SDIO_Response=SDIO_Response_Short;

	 }

	 //ret = send_command(ctrller, MMC_R5, 0);
	 SDIO_SendCommand(&SDIO_CmdInitStructure);

	 response=CmdResp4Error(SD_CMD_SDIO_RW_DIRECT);
	 //   rt_kprintf("CMD52 respond %x\r\n",response);

	 ioreg->dat = response;

	 rt_kprintf("ioreg->dat = %x\n", ioreg->dat);

	 release_io();

	 return 0;

exit:
	 release_io();
	 return -1;
}

static int check_for_valid_ioreg(ioreg_t * ioreg)
{

	 if (!ioreg) {
		  rt_kprintf("Bad ioreg\n");
		  return -1;
	 }

	 if (ioreg->function_num > 7 || ioreg->function_num >
			   card->info.num_of_io_funcs) {

		  return -1;
	 }

	 /* Check register range */
	 if ((ioreg->reg_addr & 0xfffe0000) != 0x0) {
		  return -1;
	 }

	 return 0;
}

int sdio_read_ioreg(rt_uint8_t func, rt_uint32_t reg, rt_uint8_t * dat)
{
	 int ret = -1;
	 ioreg_t ioreg;

	 /* SDIO Spec: Command 52 needs 
	  * R/W Flag if 0 this will be read data if 1 write
	  * Function number: Number of the function within I/O 
	  * Register Address: This is the address of the  register
	  * write data: This bit is set to 0 for read
	  * CRC7: 7 bits CRC
	  */

	 ioreg.read_or_write = SDIO_READ;
	 ioreg.function_num = func;
	 ioreg.reg_addr = reg;
	 ioreg.dat = 0x00;     /** Will be filled by the card */

	 ret = check_for_valid_ioreg( &ioreg);

	 if (ret < 0) {
		  rt_kprintf("Wrong parameters for rw_ioreg\n");
		  goto exit;
	 }

	 ret = rw_ioreg(&ioreg);

	 if (ret < 0) {
		  rt_kprintf("rw_ioreg failed\n");
	 } else
		  *dat = ioreg.dat;

exit:
	 return ret;
}

int sdio_write_ioreg(rt_uint8_t func, rt_uint32_t reg, rt_uint8_t dat)
{
	 int ret;
	 ioreg_t ioreg;

	 /* SDIO Spec: Command 52 needs 
	  * R/W Flag if 0 this will be read data if 1 write
	  * Function number: Number of the function within I/O 
	  * Register Address: This is the address of the byte of data inside of 
	  * the write data: This bit is set to 0 for read
	  * CRC7: 7 bits CRC
	  */

	 ioreg.read_or_write = SDIO_WRITE;
	 ioreg.function_num = func;
	 ioreg.reg_addr = reg;
	 ioreg.dat = dat;     /** Will be filled by the card */

	 ret = check_for_valid_ioreg(&ioreg);

	 if (ret < 0) {
		  rt_kprintf("Wrong parameters for rw_ioreg\n");
		  goto exit;
	 }

	 ret = rw_ioreg(&ioreg);

	 if (ret < 0) {
		  rt_kprintf("rw_ioreg failed\n");
	 }

exit:
	 return ret;
}

static int get_ioblk_size()
{
	 int ret = -1;
	 int fn;
	 rt_uint8_t dat;

	 for (fn = 0; fn <= card->info.num_of_io_funcs; fn++) {
		  /* Low byte */
		  ret = sdio_read_ioreg(FN0,FN_BLOCK_SIZE_0_REG(fn), &dat);
		  rt_kprintf("low byte of ioblk %d\r\n",dat);
		  /* High byte */
		  ret = sdio_read_ioreg(FN0,FN_BLOCK_SIZE_1_REG(fn), &dat);
		  rt_kprintf("High byte of ioblk %d\r\n",dat);
	 }

	 return ret;

