blueskycoco/rtt/bsp/stm32f10x/drivers/sdio-stm32f103.c
exit:
	 rt_kprintf("Recived a Null controller returning back\n");
	 return -1;
}

static int get_cisptr_address()
{
	 int ret, fn;
	 rt_uint8_t dat;

	 for (fn = 0; fn <= card->info.num_of_io_funcs; fn++) {

		  ret = sdio_read_ioreg(FN0,FN_CIS_POINTER_0_REG(fn), &dat);

		  card->info.cisptr[fn] = (((rt_uint32_t) dat) << 0);

		  rt_kprintf("dat = %x\n", dat);

		  ret = sdio_read_ioreg(FN0,FN_CIS_POINTER_1_REG(fn), &dat);

		  card->info.cisptr[fn] |= (((rt_uint32_t) dat) << 8);

		  rt_kprintf("dat = %x\n", dat);

		  ret = sdio_read_ioreg(FN0,FN_CIS_POINTER_2_REG(fn), &dat);

		  card->info.cisptr[fn] |= (((rt_uint32_t) dat) << 16);

		  rt_kprintf("dat = %x\n", dat);

		  rt_kprintf("Card CIS Addr = %x fn = %d\n",
					card->info.cisptr[fn], fn);

	 }

	 return 0;
}

static int read_manfid(int func)
{

	 int offset = 0;
	 rt_uint32_t manfid, card_id, ret = 0;
	 rt_uint8_t tuple, link, datah, datal;

	 do {
		  ret = sdio_read_ioreg(func,
					card->info.cisptr[func]
					+ offset, &tuple);

		  if (ret < 0)
			   return ret;

		  if (tuple == CISTPL_MANFID) {
			   offset += 2;

			   ret = sdio_read_ioreg(func,
						 card->info.cisptr[func]
						 + offset, &datal);
			   if (ret < 0)
					return ret;

			   offset++;

			   ret = sdio_read_ioreg(func,
						 card->info.cisptr[func]
						 + offset, &datah);
			   if (ret < 0)
					return ret;

			   manfid = datal | datah << 8;
			   card->manf_id = manfid;

			   offset++;

			   ret = sdio_read_ioreg(func,
						 card->info.cisptr[func]
						 + offset, &datal);
			   if (ret < 0)
					return ret;

			   offset++;

			   ret = sdio_read_ioreg(func,
						 card->info.cisptr[func]
						 + offset, &datah);
			   if (ret < 0)
					return ret;

			   card_id = datal | datah << 8;

			   card->dev_id = card_id;

			   rt_kprintf("Card id = 0%2x manfid = %x\n", card_id, manfid);
			   return manfid;
		  }

		  ret = sdio_read_ioreg(func,
					card->info.cisptr[func] +
					offset + 1, &link);
		  if (ret < 0)
			   return ret;

		  offset += link + 2;

	 } while (tuple != CISTPL_END);

	 return -1;
}
int sbi_probe_card()
{

	 int ret = 0;
	 rt_uint8_t bic;

	 /* Check for MANFID */
	 ret = read_manfid(FN0);

#define MARVELL_VENDOR_ID 0x02df
	 if (ret == MARVELL_VENDOR_ID) {
		  rt_kprintf("Marvell SDIO card detected!\n");
	 } else {
		  rt_kprintf("Ignoring a non-Marvell SDIO card...\n");
		  ret = -1;
		  goto done;
	 }

	 /* read Revision Register to get the hw revision number */
	 if (sdio_read_ioreg(FN1, CARD_REVISION_REG, &card->chiprev) < 0) {
		  rt_kprintf("cannot read CARD_REVISION_REG\n");
	 } else {
		  rt_kprintf("revsion=0x%x\n", card->chiprev);
		  switch (card->chiprev) {
			   default:
					card->block_size_512 = RT_TRUE;
					card->async_int_mode = RT_TRUE;

					/* enable async interrupt mode */
					ret = sdio_read_ioreg(FN0, BUS_INTERFACE_CONTROL_REG, &bic);
					if (ret < 0) {
						 ret = -1;
						 goto done;
					}
					bic |= ASYNC_INT_MODE;
					ret = sdio_write_ioreg(FN0, BUS_INTERFACE_CONTROL_REG, bic);
					if (ret < 0) {
						 ret = -1;
						 goto done;
					}
					break;
		  }
	 }

	 ret = 0;
done:

	 return ret;
}
static int disable_host_int_mask(rt_uint8_t mask)
{
	 int ret = 0;
	 rt_uint8_t host_int_mask;

	 /* Read back the host_int_mask register */
	 ret = sdio_read_ioreg(FN1, HOST_INT_MASK_REG,
			   &host_int_mask);
	 if (ret < 0) {
		  ret = -1;
		  goto done;
	 }

	 /* Update with the mask and write back to the register */
	 host_int_mask &= ~mask;
	 ret = sdio_write_ioreg(FN1, HOST_INT_MASK_REG,
			   host_int_mask);
	 if (ret < 0) {
		  rt_kprintf("Unable to diable the host interrupt!\n");
		  ret = -1;
		  goto done;
	 }

done:
	 return ret;
}
SD_Error SD_ProcessIRQSrc(void)
{
	rt_kprintf("in SD_ProcessIRQSrc %x\r\n",SDIO_GetITStatus(SDIO_IT_SDIOIT));
	if(SDIO_GetITStatus(SDIO_IT_SDIOIT)==SET)
	SDIO_ClearITPendingBit(SDIO_IT_SDIOIT);
}
void SDIO_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    /* Process All SDIO Interrupt Sources */
    SD_ProcessIRQSrc();

    /* leave interrupt */
    rt_interrupt_leave();
}

int sdio_request_irq()
{
	 int ret, func;
	 rt_uint8_t io_enable_reg, int_enable_reg;
	 //sdio_ctrller *ctrller;

	 //_ENTER();

	 //net_devid = dev_id;

	 //sdioint_handler = handler;

	 //_DBGMSG("address of dev_id = %p sdioint_handler =%p\n",
	//		   net_devid, sdioint_handler);
	 if (!card->card_int_ready)
		  card->card_int_ready = YES;

	 io_enable_reg = 0x0;

	 int_enable_reg = IENM;

	 for (func = 1; func <= 7 && func <=
			   card->info.num_of_io_funcs; func++) {

		  io_enable_reg |= IOE(func);
		  int_enable_reg |= IEN(func);
	 }

	 /** Enable function IOs on card */
	 sdio_write_ioreg(FN0, IO_ENABLE_REG, io_enable_reg);
	 /** Enable function interrupts on card */
	 sdio_write_ioreg(FN0, INT_ENABLE_REG, int_enable_reg);

	 //MMC_I_MASK &= ~MMC_I_MASK_SDIO_INT;
	 //wmb();
	 //_PRINTK("sdio_request_irq: MMC_I_MASK = 0x%x\n", MMC_I_MASK);

//#ifdef DEBUG_SDIO_LEVEL1
	 //print_addresses(ctrller);
//#endif

	 ret = 0;
//	 _LEAVE();

done:
	 return ret;
}

int sbi_register_dev()
{
	 int ret = 0;
	 rt_uint8_t reg;
	 rt_uint32_t ioport;
	 //mmc_card_t card = (mmc_card_t) priv->wlan_dev.card;

	 //ENTER();

	 /* Initialize the private structure */
	 //strncpy(priv->wlan_dev.name, "sdio0", sizeof(priv->wlan_dev.name));
	 //priv->wlan_dev.ioport = 0;
	 //priv->wlan_dev.upld_rcv = 0;
	 //priv->wlan_dev.upld_typ = 0;
	 //priv->wlan_dev.upld_len = 0;
	 ioport=0;
	 /* Read the IO port */
	 ret = sdio_read_ioreg(FN1, IO_PORT_0_REG, &reg);
	 if (ret < 0)
		  goto failed;
	 else
		  ioport |= reg;

	 ret = sdio_read_ioreg(FN1, IO_PORT_1_REG, &reg);
	 if (ret < 0)
		  goto failed;
	 else
		  ioport |= (reg << 8);

	 ret = sdio_read_ioreg(FN1, IO_PORT_2_REG, &reg);
	 if (ret < 0)
		  goto failed;
	 else
		  ioport |= (reg << 16);

	 rt_kprintf("SDIO FUNC1 IO port: 0x%x\n", ioport);

	 /* Disable host interrupt first. */
	 if ((ret = disable_host_int_mask(0xff)) < 0) {
		  rt_kprintf("Warning: unable to disable host interrupt!\n");
	 }

	 /* Request the SDIO IRQ */
	// rt_kprintf("Before request_irq Address is if==>%p\n", isr_function);
	 ret = sdio_request_irq();

	 if (ret < 0) {
		  rt_kprintf("Failed to request IRQ on SDIO bus (%d)\n", ret);
		  goto failed;
	 }

