blueskycoco/rtt/bsp/stm32f10x/drivers/sdio-stm32f103.c
	 //rt_kprintf(INFO, "IrqLine: %d\n", card->ctrlr->tmpl->irq_line);
	 //priv->wlan_dev.netdev->irq = card->ctrlr->tmpl->irq_line;
	 //priv->adapter->irq = priv->wlan_dev.netdev->irq;
	 //priv->adapter->chip_rev = card->chiprev;
	 //priv->adapter->sdiomode =
	//	  ((mmc_card_t) ((priv->wlan_dev).card))->ctrlr->bus_width;
//#if defined(_MAINSTONE) || defined(SYSKT)
//	 if (request_gpio_irq_callback
//			   ((void (*)(void *)) gpio_irq_callback, (void *) priv))
//		  rt_kprintf(FATAL, "Failed to request GPIO IRQ callback\n");
//#endif /* _MAINSTONE || SYSKT */

	 return 0;

failed:
	 //priv->wlan_dev.card = NULL;

	 return -1;
}
int sbi_get_cis_info()
{
    //mmc_card_t card = (mmc_card_t) priv->wlan_dev.card;
    //wlan_adapter *Adapter = priv->adapter;
    rt_uint8_t tupledata[255];
    int i;
    rt_uint32_t ret = 0;

    //ENTER();

    /* Read the Tuple Data */
    for (i = 0; i < sizeof(tupledata); i++) {
        ret = sdio_read_ioreg(FN0, card->info.cisptr[FN0] + i,
                              &tupledata[i]);
        if (ret) {
            rt_kprintf(WARN, "get_cis_info error:%d\n", ret);
            return WLAN_STATUS_FAILURE;
        }
    }

    /* Copy the CIS Table to Adapter */
    memset(card->CisInfoBuf, 0x0, sizeof(card->CisInfoBuf));
    memcpy(card->CisInfoBuf, tupledata, sizeof(tupledata));
    card->CisInfoLen = sizeof(tupledata);

   // LEAVE();
    return 0;
}
int sbi_disable_host_int()
{
    return disable_host_int_mask(HIM_DISABLE);
}
static int mv_sdio_read_scratch(rt_uint16_t * dat)
{
    int ret = 0;
    rt_uint8_t scr0;
    rt_uint8_t scr1;
    ret = sdio_read_ioreg(FN1, CARD_OCR_0_REG, &scr0);
    if (ret < 0)
        return -1;

    ret = sdio_read_ioreg(FN1, CARD_OCR_1_REG, &scr1);
    rt_kprintf("CARD_OCR_0_REG = 0x%x, CARD_OCR_1_REG = 0x%x\n", scr0,
           scr1);
    if (ret < 0)
        return -1;

    *dat = (((u16) scr1) << 8) | scr0;

    return 0;
}
static int mv_sdio_poll_card_status(rt_uint8_t bits)
{
    int tries;
    int rval;
    rt_uint8_t cs;

    for (tries = 0; tries < MAX_POLL_TRIES; tries++) {
        rval = sdio_read_ioreg(FN1,
                               CARD_STATUS_REG, &cs);
        if (rval == 0 && (cs & bits) == bits) {
            return 0;
        }

        rt_thread_delay(10);
    }

    rt_kprintf("mv_sdio_poll_card_status: FAILED!:%d\n", rval);
    return -1;
}

static int sbi_prog_firmware_image(const rt_uint8_t * firmware, int firmwarelen)
{
    int ret = 0;
    rt_uint16_t firmwarestat;
    rt_uint8_t *fwbuf = card->TmpTxBuf;
    int fwblknow;
    rt_uint32_t tx_len;

    //ENTER();

    /* Check if the firmware is already downloaded */
    if ((ret = mv_sdio_read_scratch(&firmwarestat)) < 0) {
        rt_kprintf("read scratch returned <0\n");
        goto done;
    }

    if (firmwarestat == FIRMWARE_READY) {
        rt_kprintf("FW already downloaded!\n");
        ret = 0;
        goto done;
    }

    rt_kprintf("Downloading helper image (%d bytes), block size %d bytes\n",
           firmwarelen, SD_BLOCK_SIZE_FW_DL);

    /* Perform firmware data transfer */
    tx_len =
        (FIRMWARE_TRANSFER_NBLOCK * SD_BLOCK_SIZE_FW_DL) - SDIO_HEADER_LEN;
    for (fwblknow = 0; fwblknow < firmwarelen; fwblknow += tx_len) {

        /* The host polls for the DN_LD_CARD_RDY and CARD_IO_READY bits */
        ret = mv_sdio_poll_card_status(CARD_IO_READY | DN_LD_CARD_RDY);
        if (ret < 0) {
            rt_kprintf("FW download died @ %d\n", fwblknow);
            goto done;
        }

        /* Set blocksize to transfer - checking for last block */
        if (firmwarelen - fwblknow < tx_len)
            tx_len = firmwarelen - fwblknow;

        fwbuf[0] = ((tx_len & 0x000000ff) >> 0);        /* Little-endian */
        fwbuf[1] = ((tx_len & 0x0000ff00) >> 8);
        fwbuf[2] = ((tx_len & 0x00ff0000) >> 16);
        fwbuf[3] = ((tx_len & 0xff000000) >> 24);

        /* Copy payload to buffer */
        memcpy(&fwbuf[SDIO_HEADER_LEN], &firmware[fwblknow], tx_len);

        rt_kprintf(".");

        /* Send data */
        ret = sdio_write_iomem(priv->wlan_dev.card, FN1,
                               priv->wlan_dev.ioport, BLOCK_MODE,
                               FIXED_ADDRESS, FIRMWARE_TRANSFER_NBLOCK,
                               SD_BLOCK_SIZE_FW_DL, fwbuf);

        if (ret < 0) {
            rt_kprintf("IO error: transferring block @ %d\n", fwblknow);
            goto done;
        }
    }

#ifdef FW_DOWNLOAD_SPEED
    tv2 = get_utimeofday();
    rt_kprintf("helper: %ld.%03ld.%03ld ", tv1 / 1000000,
           (tv1 % 1000000) / 1000, tv1 % 1000);
    rt_kprintf(" -> %ld.%03ld.%03ld ", tv2 / 1000000,
           (tv2 % 1000000) / 1000, tv2 % 1000);
    tv2 -= tv1;
    rt_kprintf(" == %ld.%03ld.%03ld\n", tv2 / 1000000,
           (tv2 % 1000000) / 1000, tv2 % 1000);
#endif

    /* Write last EOF data */
    rt_kprintf("\nTransferring EOF block\n");
    memset(fwbuf, 0x0, SD_BLOCK_SIZE_FW_DL);
    ret = sdio_write_iomem(priv->wlan_dev.card, FN1,
                           priv->wlan_dev.ioport, BLOCK_MODE,
                           FIXED_ADDRESS, 1, SD_BLOCK_SIZE_FW_DL, fwbuf);

    if (ret < 0) {
        rt_kprintf("IO error in writing EOF FW block\n");
        goto done;
    }

    ret = 0;

  done:
    return ret;
}

int wlan_setup_station_hw()
{
sbi_disable_host_int();

}
rt_uint32_t CmdResp4Error(uint8_t cmd)
{
	 SD_Error errorstatus = SD_OK;
	 uint32_t status;
	 uint32_t response_r1;
	 uint32_t response_r2;

	 status = SDIO->STA;
	 //rt_kprintf("1 status=%x\r\n",status);
	 if(SDIO_CmdInitStructure.SDIO_Wait==SDIO_Wait_IT)
	 {
		  while (!(status & (SDIO_IT_SDIOIT)))
		  {    
			   status = SDIO->STA;
		  }
	 }
	 else
	 {
		  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
		  {    
			   status = SDIO->STA;
		  }
	 }
	 //  rt_kprintf("2 status=%x\r\n",status);
	 if (status & SDIO_FLAG_CTIMEOUT)
	 {
		  errorstatus = SD_CMD_RSP_TIMEOUT;
		  SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);	   
		  return(errorstatus);
	 }
	 else if (status & SDIO_FLAG_CCRCFAIL)
	 {
		  errorstatus = SD_CMD_CRC_FAIL;
		  SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
		  return(errorstatus);
	 }

	 /* Check response received is of desired command */
	 if ((SDIO_GetCommandResponse() != cmd)&&(SDIO_GetCommandResponse()!=0x3f))
	 {
		  rt_kprintf("illegal cmd %x\r\n",SDIO_GetCommandResponse());
		  errorstatus = SD_ILLEGAL_CMD;
		  return(errorstatus);
	 }
	 /* Clear all the static flags */
	 SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	 /* We have received response, retrieve it for analysis  */
	 response_r1 = SDIO_GetResponse(SDIO_RESP1);		
	 return response_r1;
}
void SD_LowLevel_Init(void)
{
	 GPIO_InitTypeDef  GPIO_InitStructure;

